'''
На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет количество гласных и согласных букв.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести количество гласных и согласных букв.
Примечание. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).
'''

s = input()
          
print('Количество гласных букв равно', len(s.translate({ord(i): None for i in 'бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ –!,.ь'})))
print('Количество согласных букв равно', len(s.translate({ord(i): None for i in 'ауоыиэяюёеАУОЫИЭЯЮЁЕ –!,.ь'})) )
